example/app/controllers/contents_controller.rb

  def balance_by_category
    @contents = Content.all.balance_by_type(type_field: :category)
---
SELECT "contents".* FROM "contents"

  def balance_by_content_type
    @contents = Content.all.balance_by_type(type_field: :content_type)
---
SELECT "contents".* FROM "contents"