example/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.balance_by_type
---
SELECT "posts".* FROM "posts"